liujkek22/CTcloud-309/Liliuyu FTP_LI/STM32 Project/STM32F103C8T6/进阶项目/基于STM32F103C8T6 简易示波器/源码/Hardware/OLED.c
#include "stm32f10x.h"
#include "OLED_Font.h"
#include "Delay.h"
#include "AD.h"

unsigned char GRAM[1024];//缓冲数组


/*引脚配置*/
#define OLED_W_SCL(x)		GPIO_WriteBit(GPIOB, GPIO_Pin_8, (BitAction)(x))
#define OLED_W_SDA(x)		GPIO_WriteBit(GPIOB, GPIO_Pin_9, (BitAction)(x))


/*引脚初始化*/
void OLED_I2C_Init(void)
{
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
	
	GPIO_InitTypeDef GPIO_InitStructure;
 	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;
 	GPIO_Init(GPIOB, &GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
 	GPIO_Init(GPIOB, &GPIO_InitStructure);
	
	OLED_W_SCL(1);
	OLED_W_SDA(1);
}

/**
  * @brief  I2C开始
  * @param  无
  * @retval 无
  */
void OLED_I2C_Start(void)
{
	OLED_W_SDA(1);
	OLED_W_SCL(1);
	OLED_W_SDA(0);
	OLED_W_SCL(0);
}

/**
  * @brief  I2C停止
  * @param  无
  * @retval 无
  */
void OLED_I2C_Stop(void)
{
	OLED_W_SDA(0);
	OLED_W_SCL(1);
	OLED_W_SDA(1);
}

/**
  * @brief  I2C发送一个字节
  * @param  Byte 要发送的一个字节
  * @retval 无
  */
void OLED_I2C_SendByte(uint8_t Byte)
{
	uint8_t i;
	for (i = 0; i < 8; i++)
	{
		OLED_W_SDA(Byte & (0x80 >> i));
		OLED_W_SCL(1);
		OLED_W_SCL(0);
	}
	OLED_W_SCL(1);	//额外的一个时钟，不处理应答信号
	OLED_W_SCL(0);
}

/**
  * @brief  OLED写命令
  * @param  Command 要写入的命令
  * @retval 无
  */
void OLED_WriteCommand(uint8_t Command)
{
	OLED_I2C_Start();
	OLED_I2C_SendByte(0x78);		//从机地址
	OLED_I2C_SendByte(0x00);		//写命令
	OLED_I2C_SendByte(Command); 
	OLED_I2C_Stop();
}

/**
  * @brief  OLED写数据
  * @param  Data 要写入的数据
  * @retval 无
  */
void OLED_WriteData(uint8_t Data)
{
	OLED_I2C_Start();
	OLED_I2C_SendByte(0x78);		//从机地址
	OLED_I2C_SendByte(0x40);		//写数据
	OLED_I2C_SendByte(Data);
	OLED_I2C_Stop();
}

/**
  * @brief  OLED设置光标位置
  * @param  Y 以左上角为原点，向下方向的坐标，范围：0~7
  * @param  X 以左上角为原点，向右方向的坐标，范围：0~127
  * @retval 无
  */
void OLED_SetCursor(uint8_t Y, uint8_t X)//定点
{
	OLED_WriteCommand(0xB0 | Y);					//设置Y位置
	OLED_WriteCommand(0x10 | ((X & 0xF0) >> 4));	//设置X位置低4位
	OLED_WriteCommand(0x00 | (X & 0x0F));			//设置X位置高4位
}

/**
  * @brief  OLED清屏
  * @param  无
  * @retval 无
  */
void OLED_Clear(void)
{  
	uint8_t i, j;
	for (j = 0; j < 8; j++)
	{
		OLED_SetCursor(j, 0);
		for(i = 0; i < 128; i++)
		{
			OLED_WriteData(0x00);
		}
	}
}

/**
  * @brief  OLED显示一个字符
  * @param  Line 行位置，范围：1~4
  * @param  Column 列位置，范围：1~16
  * @param  Char 要显示的一个字符，范围：ASCII可见字符
  * @retval 无
  */
void OLED_ShowChar(uint8_t Line, uint8_t Column, char Char)
{      	
	uint8_t i;
	OLED_SetCursor((Line - 1) * 2, (Column - 1) * 8);		//设置光标位置在上半部分
	for (i = 0; i < 8; i++)
	{
		OLED_WriteData(OLED_F8x16[Char - ' '][i]);			//显示上半部分内容
	}
	OLED_SetCursor((Line - 1) * 2 + 1, (Column - 1) * 8);	//设置光标位置在下半部分
	for (i = 0; i < 8; i++)
	{
		OLED_WriteData(OLED_F8x16[Char - ' '][i + 8]);		//显示下半部分内容
	}
}

/**
  * @brief  OLED显示字符串
  * @param  Line 起始行位置，范围：1~4
  * @param  Column 起始列位置，范围：1~16
  * @param  String 要显示的字符串，范围：ASCII可见字符
  * @retval 无
  */
void OLED_ShowString(uint8_t Line, uint8_t Column, char *String)
{
	uint8_t i;
	for (i = 0; String[i] != '\0'; i++)
	{
		OLED_ShowChar(Line, Column + i, String[i]);
	}
}

/**
  * @brief  OLED次方函数
  * @retval 返回值等于X的Y次方
  */
uint32_t OLED_Pow(uint32_t X, uint32_t Y)
{
	uint32_t Result = 1;
	while (Y--)
	{
		Result *= X;
	}
	return Result;
}

/**
  * @brief  OLED显示数字（十进制，正数）
  * @param  Line 起始行位置，范围：1~4
  * @param  Column 起始列位置，范围：1~16
  * @param  Number 要显示的数字，范围：0~4294967295
  * @param  Length 要显示数字的长度，范围：1~10
  * @retval 无
  */
void OLED_ShowNum(uint8_t Line, uint8_t Column, uint32_t Number, uint8_t Length)
{
	uint8_t i;
	for (i = 0; i < Length; i++)							
	{
		OLED_ShowChar(Line, Column + i, Number / OLED_Pow(10, Length - i - 1) % 10 + '0');
	}
}

/**
  * @brief  OLED显示数字（十进制，带符号数）
  * @param  Line 起始行位置，范围：1~4
  * @param  Column 起始列位置，范围：1~16
  * @param  Number 要显示的数字，范围：-2147483648~2147483647
  * @param  Length 要显示数字的长度，范围：1~10
  * @retval 无
  */
void OLED_ShowSignedNum(uint8_t Line, uint8_t Column, int32_t Number, uint8_t Length)
{
	uint8_t i;
	uint32_t Number1;
	if (Number >= 0)
	{
		OLED_ShowChar(Line, Column, '+');
		Number1 = Number;
	}
	else
	{
		OLED_ShowChar(Line, Column, '-');
		Number1 = -Number;
	}
	for (i = 0; i < Length; i++)							
	{
		OLED_ShowChar(Line, Column + i + 1, Number1 / OLED_Pow(10, Length - i - 1) % 10 + '0');
	}
}

/**
  * @brief  OLED显示数字（十六进制，正数）
  * @param  Line 起始行位置，范围：1~4
  * @param  Column 起始列位置，范围：1~16
  * @param  Number 要显示的数字，范围：0~0xFFFFFFFF
  * @param  Length 要显示数字的长度，范围：1~8
  * @retval 无
  */
void OLED_ShowHexNum(uint8_t Line, uint8_t Column, uint32_t Number, uint8_t Length)
{
	uint8_t i, SingleNumber;
	for (i = 0; i < Length; i++)							
	{
		SingleNumber = Number / OLED_Pow(16, Length - i - 1) % 16;
		if (SingleNumber < 10)
		{
			OLED_ShowChar(Line, Column + i, SingleNumber + '0');
		}
		else
		{
			OLED_ShowChar(Line, Column + i, SingleNumber - 10 + 'A');
		}
	}
}

/**
  * @brief  OLED显示数字（二进制，正数）
  * @param  Line 起始行位置，范围：1~4
  * @param  Column 起始列位置，范围：1~16
  * @param  Number 要显示的数字，范围：0~1111 1111 1111 1111
  * @param  Length 要显示数字的长度，范围：1~16
  * @retval 无
  */
void OLED_ShowBinNum(uint8_t Line, uint8_t Column, uint32_t Number, uint8_t Length)
{
	uint8_t i;
	for (i = 0; i < Length; i++)							
	{
		OLED_ShowChar(Line, Column + i, Number / OLED_Pow(2, Length - i - 1) % 2 + '0');
	}
}

/**
  * @brief  OLED初始化
  * @param  无
  * @retval 无
  */
void OLED_Init(void)
{
	uint32_t i, j;
	
	for (i = 0; i < 1000; i++)			//上电延时
	{
		for (j = 0; j < 1000; j++);
	}
	
	OLED_I2C_Init();			//端口初始化
	
	OLED_WriteCommand(0xAE);	//关闭显示
	
	OLED_WriteCommand(0xD5);	//设置显示时钟分频比/振荡器频率
	OLED_WriteCommand(0x80);
	
	OLED_WriteCommand(0xA8);	//设置多路复用率
	OLED_WriteCommand(0x3F);
	
	OLED_WriteCommand(0xD3);	//设置显示偏移
	OLED_WriteCommand(0x00);
	
	OLED_WriteCommand(0x40);	//设置显示开始行
	
	OLED_WriteCommand(0xA1);	//设置左右方向，0xA1正常 0xA0左右反置
	
	OLED_WriteCommand(0xC8);	//设置上下方向，0xC8正常 0xC0上下反置

	OLED_WriteCommand(0xDA);	//设置COM引脚硬件配置
	OLED_WriteCommand(0x12);
	
	OLED_WriteCommand(0x81);	//设置对比度控制
	OLED_WriteCommand(0xCF);

	OLED_WriteCommand(0xD9);	//设置预充电周期
	OLED_WriteCommand(0xF1);

	OLED_WriteCommand(0xDB);	//设置VCOMH取消选择级别
	OLED_WriteCommand(0x30);

	OLED_WriteCommand(0xA4);	//设置整个显示打开/关闭

	OLED_WriteCommand(0xA6);	//设置正常/倒转显示

	OLED_WriteCommand(0x8D);	//设置充电泵
	OLED_WriteCommand(0x14);

	OLED_WriteCommand(0xAF);	//开启显示
		
	OLED_Clear();				//OLED清屏
}

/**
  * @brief  显示汉字串
  * @param  Line 起始行位置，范围：1~4
  * @param  Column 起始列位置，范围：1~8
  * @param  Start 汉字串在字库中的起始位置序列
  * @param  End   汉字串在字库中的结束位置序列
  * @retval 无
  */
void OLED_ShowChineseString(uint8_t Line, uint8_t Column, uint8_t Start, uint8_t End)
{
	uint8_t i,j=0;
	uint16_t addr=32*Start;
	for(j=Start;j<(End+1);j++)
	{
		OLED_SetCursor((Line-1)*2,(Column-1+j-Start)*16);
		for(i=0;i<16;i++)
		{
			OLED_WriteData(OLED_Font[addr]);
			addr+=1;
		}
		OLED_SetCursor((Line-1)*2+1,(Column-1+j-Start)*16);
		for(i=0;i<16;i++)
		{
			OLED_WriteData(OLED_Font[addr]);
			addr+=1;
		}
	}
}

/**
  * @brief   显示图片
  * @param   Line 起始行位置，范围：1~8
  * @param   Column 起始列位置，范围：1~128
  * @param   x 图片横向像素，x<=128
  * @param   y 图片纵向像素，y<=64
  * @retval  无
  */
void OLED_ShowPicture(uint8_t Line, uint8_t Column, uint8_t x, uint8_t y)
{
	uint8_t i=0;
	uint8_t j=0;
	uint16_t addr=0;
	
	for(i=Line;i<(y/8)+Line;i++)
	{
		OLED_SetCursor(i-1,Column-1);
		for(j=0;j<x;j++)
		{
			OLED_WriteData(OLED_Picture[addr]);
			addr+=1;
		}
	}
}

/**
  * @brief   显示GIF动图(单帧图片像素只能为（128×64）)
  * @param   Num 图片的帧数
  * @retval  无
  */
void OLED_ShowGIF(uint8_t Num)
{
	uint8_t i=0;
	uint8_t j=0;
	uint8_t k=0;
	uint16_t addr=0;
	for(k=0;k<(Num-1);k++)
	{
		for(i=0;i<8;i++)
		{
			OLED_SetCursor(i,0);
			for(j=0;j<128;j++)
			{
				OLED_WriteData(OLED_GIF[addr]);
				addr+=1;
			}
		}
		Delay_ms(100);
	}
}



void OLED_ShowBMP(u8 x0,u8 y0,u8 x1,u8 y1,uint8_t BMP[])
{
    unsigned int j = 0;
    unsigned char x,y;
    for(y = y0;y<y1;y++)
    {
        OLED_SetCursor(y,x0);
        for(x=x0;x<x1;x++)
        {
            OLED_WriteData(BMP[j++]);
        }
    }
}

void OLED_Refresh(void)
{
    unsigned int j = 0;
    unsigned char x,y;
    
    for(y=0;y<8;y++)
    {
        OLED_SetCursor(y,0);
        for(x=0;x<128;x++)
        {
            OLED_WriteData(GRAM[j++]);
        }
    }
}
    
void OLED_GFill(void)
{
    unsigned int t;
    for(t=0;t<1024;t++)
    {
        GRAM[t]=0xFF;
    }
    OLED_Refresh();
}

void OLED_GClear(void)
{
    unsigned int t;
    for(t=0;t<1024;t++)
    {
        GRAM[t]=0x00;
    }
    OLED_Refresh();
}

void OLED_DrawPoint(unsigned char x,unsigned char y)
{
//    unsigned char x;显示屏横向坐标
//    unsigned char y;显示屏竖向坐标
    
    unsigned char n,m;
    if((x>127)||(y>63)) return;
    
    n = y / 8;      //n=0~7（行序号）
    m = y % 8;      //m=0~7（单列的位置序号）
    
    GRAM[n*128+x] |=0x01<<m;
}

void OLED_ClearPoint(unsigned char x,unsigned char y)
{
//    unsigned char x;显示屏横向坐标
//    unsigned char y;显示屏竖向坐标
    
    unsigned char n,m;
    if((x>127)||(y>63)) return;
    
    n = y / 8;      //n=0~7（行序号）
    m = y % 8;      //m=0~7（单列的位置序号）
    
    GRAM[n*128+x] &=~(0x01<<m);
}

void FourPoints(u8 xstart,u8 ystart)//灰度采样
{
    u8 x,y;
    
    for(y=ystart;y<64;y+=2)
    {
        for(x=xstart;x<128;x+=2)
        { 
            GRAM[y/8*128+x] |= 0x01 << (y%8);       
        }
    } 
}

unsigned char ADCdata[128]={
    22,156,180,56,44,132,13,121,86,187,76,182,21,147,4,167,11,22,85,
    177,16,0,176,7,11,231,172,177,183,158,111,77,129,95,186,237,219,
    2,201,67,146,200,97,12,219,93,180,98,148,22,156,180,56,44,132,13,
    121,86,187,76,182,21,147,4,167,11,22,85,0,176,7,11,231,172,177,
    183,158,111,7,177,16,0,176,7,11,231,172,177,183,158,111,7,21,147,
    4,167,11,22,85,0,176,187,76,182,21,147,4,167,11,22,85,0,187,76,182,
    21,147,4,167,
};
void ADCWave(uint8_t step)//Step为步进数
{
    uint8_t PiontX,PiontY;//画点坐标
    uint8_t Xtime;//X坐标，即数据序号
    uint8_t range = 63;//屏幕竖向显示范围

    float scale = (float)range /255;//scale换算比列，255为数据范围

    uint8_t PiontXlast,PiontYlast;
    PiontX = 0;
    PiontY = ADCdata[0]*scale;
    OLED_ShowString(0,0,"setp=");
    OLED_ShowNum(0,6,step,2);
    for(Xtime = 0;Xtime < 128;Xtime += step)
    {
       PiontX=Xtime;
       PiontY=ADCdata[Xtime]*scale;
       OLED_DrawPoint(PiontX,63-PiontY);
       OLED_Refresh();Delay_ms(50);
    }



    
}
